# European Climate Dataset

### 1. Import the csv file

In [1]:
import pandas as pd
countries = pd.read_csv('data_sets/country_codes.csv')
countries.head()

             name alpha2 alpha3  code      lat    lon
0     Afghanistan     AF    AFG     4  33.0000   65.0
1         Albania     AL    ALB     8  41.0000   20.0
2         Algeria     DZ    DZA    12  28.0000    3.0
3  American Samoa     AS    ASM    16 -14.3333 -170.0
4         Andorra     AD    AND    20  42.5000    1.6

### 2. With Python, define a countries table in the climate database

In [2]:
from sqlalchemy import create_engine
import os
from dotenv import load_dotenv

In [3]:
load_dotenv('.env')

True

In [4]:
URL_climate = os.getenv('url')

In [5]:
# Create the connection to the DataBase

engine = create_engine(URL_climate, echo=False)

### 3. Load the data frame into the countries table

#### Use this script as a reference:

In [6]:
#Connect to the database and create the table in this Database.

with engine.begin() as conn:
    conn.execute("DROP TABLE IF EXISTS countries CASCADE;")
    conn.execute("""
        CREATE TABLE countries (
            alpha2 VARCHAR(2) PRIMARY KEY,
            name VARCHAR,
            alpha3 VARCHAR(3),
            code INT,
            lat NUMERIC,
            lon NUMERIC
        );
    """)

In [7]:
#Uploading the dataframe stored in the jupiter notebook to the database

countries.to_sql('countries', engine, if_exists='append', index= False)

243

In [8]:
countries

                  name alpha2 alpha3  code      lat    lon
0          Afghanistan     AF    AFG     4  33.0000   65.0
1              Albania     AL    ALB     8  41.0000   20.0
2              Algeria     DZ    DZA    12  28.0000    3.0
3       American Samoa     AS    ASM    16 -14.3333 -170.0
4              Andorra     AD    AND    20  42.5000    1.6
..                 ...    ...    ...   ...      ...    ...
238  Wallis and Futuna     WF    WLF   876 -13.3000 -176.2
239     Western Sahara     EH    ESH   732  24.5000  -13.0
240              Yemen     YE    YEM   887  15.0000   48.0
241             Zambia     ZM    ZMB   894 -15.0000   30.0
242           Zimbabwe     ZW    ZWE   716 -20.0000   30.0

[243 rows x 6 columns]

# Stations Data

##### Using the stations file found in the downloaded ECA_blend data folder proceed with it in the same way as for the countries data from the previous exercise. Use the downloaded stations file as it will have all stations found in the downloaded datasets.

In [9]:
stations = pd.read_csv('data_sets/ECA_blend_tg/stations.txt', skiprows= 17)
stations.head()

,STAID,STANAME,CN,LAT,LON,HGHT
0,1,VAEXJOE,SE,+56:52:00,+014:48:00,166
1,2,FALUN,SE,+60:37:00,+015:37:00,160
2,3,STENSELE,SE,+65:04:00,+017:09:59,325
3,4,LINKOEPING,SE,+58:24:00,+015:31:59,93
4,5,LINKOEPING-MALMSLAETT,SE,+58:24:00,+015:31:59,93

## Data cleanup

##### 3. You need to cleanup the column names of the file. Watch out for whitespace and convert the names to lowercase

In [10]:
# Some of the names have extra white spaces.

stations.columns

Index(['STAID', 'STANAME                                 ', 'CN', '      LAT',
       '       LON', 'HGHT'],
      dtype='object')

In [11]:
stations.rename(columns = {'STANAME                                 ':'STANAME','      LAT':'LAT','       LON':'LON','HGHT':'HIGHT'}, inplace = True)

In [12]:
stations.columns

Index(['STAID', 'STANAME', 'CN', 'LAT', 'LON', 'HIGHT'], dtype='object')

In [13]:
# Transform the names to lowercase 

stations['STANAME'] = stations['STANAME'].str.lower()

In [14]:
stations.columns = stations.columns.str.lower()
stations.head()

,staid,staname,cn,lat,lon,hight
0,1,vaexjoe,SE,+56:52:00,+014:48:00,166
1,2,falun,SE,+60:37:00,+015:37:00,160
2,3,stensele,SE,+65:04:00,+017:09:59,325
3,4,linkoeping,SE,+58:24:00,+015:31:59,93
4,5,linkoeping-malmslaett,SE,+58:24:00,+015:31:59,93

In [15]:
stations.columns

Index(['staid', 'staname', 'cn', 'lat', 'lon', 'hight'], dtype='object')

In [16]:
# 'cn' column values have extra white spaces

# Option 1 to remove white spaces: using .str.strip() on the the column directly.
# Warning: it only works if the column values type is string. 

stations['cn']= stations['cn'].str.strip()

In [17]:
stations.columns.to_list()

['staid', 'staname', 'cn', 'lat', 'lon', 'hight']

In [18]:
# Option 2 to remove extra white spaces: create a new list with the columns with values having
# extra white spaces, run a for loop in this list and use str.strip(). 

new_list = ['staname','cn']
for column in new_list:
    stations[column]= stations[column].str.strip()

##### 4. Add a foreign key constraint for the cn column and let it point to the alpha2 column of the countries table

In [19]:
with engine.begin() as conn:
    conn.execute("""
        DROP TABLE IF EXISTS stations CASCADE;
        CREATE TABLE stations (
            staid INT,
            staname VARCHAR,
            cn VARCHAR REFERENCES countries(alpha2),
            lat VARCHAR,
            lon VARCHAR, 
            hight VARCHAR
        );    
    """)

In [20]:
stations.to_sql('stations', engine, if_exists='append', index=False)

455

In [21]:
stations

      staid                staname  cn        lat         lon  hight
0         1                vaexjoe  SE  +56:52:00  +014:48:00    166
1         2                  falun  SE  +60:37:00  +015:37:00    160
2         3               stensele  SE  +65:04:00  +017:09:59    325
3         4             linkoeping  SE  +58:24:00  +015:31:59     93
4         5  linkoeping-malmslaett  SE  +58:24:00  +015:31:59     93
...     ...                    ...  ..        ...         ...    ...
6450  25150  gdansk-rebiechowo_old  PL  +54:22:59  +018:28:00    144
6451  25151        elblag-milejewo  PL  +54:13:23  +019:32:36    151
6452  25156                 krosno  PL  +49:42:24  +021:46:09    326
6453  25157         ylja kraftverk  NO  +61:11:49  +008:22:50    517
6454  25159              farkollen  NO  +69:48:15  +028:59:36    321

[6455 rows x 6 columns]

In [22]:
#reading the table "station" already in the database.

with engine.begin() as conn: 
    result = conn.execute("""
        TABLE stations
        Limit 5;""")
    data = result.all()
print(data)

[(1, 'vaexjoe', 'SE', '+56:52:00', '+014:48:00', '166'), (2, 'falun', 'SE', '+60:37:00', '+015:37:00', '160'), (3, 'stensele', 'SE', '+65:04:00', '+017:09:59', '325'), (4, 'linkoeping', 'SE', '+58:24:00', '+015:31:59', '93'), (5, 'linkoeping-malmslaett', 'SE', '+58:24:00', '+015:31:59', '93')]

In [23]:
stations_df= pd.DataFrame(data, index = None)

In [24]:
#reading the table "countries" already on the database.

with engine.begin() as conn: 
    result = conn.execute("""
        TABLE countries
        Limit 5;""")
    data = result.all()
print(data)

[('AF', 'Afghanistan', 'AFG', 4, Decimal('33.0'), Decimal('65.0')), ('AL', 'Albania', 'ALB', 8, Decimal('41.0'), Decimal('20.0')), ('DZ', 'Algeria', 'DZA', 12, Decimal('28.0'), Decimal('3.0')), ('AS', 'American Samoa', 'ASM', 16, Decimal('-14.3333'), Decimal('-170.0')), ('AD', 'Andorra', 'AND', 20, Decimal('42.5'), Decimal('1.6'))]

In [25]:
pd.DataFrame(data)

  alpha2            name alpha3  code       lat     lon
0     AF     Afghanistan    AFG     4      33.0    65.0
1     AL         Albania    ALB     8      41.0    20.0
2     DZ         Algeria    DZA    12      28.0     3.0
3     AS  American Samoa    ASM    16  -14.3333  -170.0
4     AD         Andorra    AND    20      42.5     1.6

In [26]:
#Reading and Running SQL statments

with engine.begin() as conn: 
    result = conn.execute("""
        SELECT *
        FROM stations st
        JOIN countries cnt
        ON st.cn = cnt.alpha2;""")
    data = result.all()
#print(data)

In [27]:
stations_countries_df = pd.DataFrame(data, index = None)
stations_countries_df

,staid,staname,cn,lat,lon,hight,alpha2,name,alpha3,code,lat,lon
0,1,vaexjoe,SE,+56:52:00,+014:48:00,166,SE,Sweden,SWE,752,62.0,15.0
1,2,falun,SE,+60:37:00,+015:37:00,160,SE,Sweden,SWE,752,62.0,15.0
2,3,stensele,SE,+65:04:00,+017:09:59,325,SE,Sweden,SWE,752,62.0,15.0
3,4,linkoeping,SE,+58:24:00,+015:31:59,93,SE,Sweden,SWE,752,62.0,15.0
4,5,linkoeping-malmslaett,SE,+58:24:00,+015:31:59,93,SE,Sweden,SWE,752,62.0,15.0
...,...,...,...,...,...,...,...,...,...,...,...,...
6450,25150,gdansk-rebiechowo_old,PL,+54:22:59,+018:28:00,144,PL,Poland,POL,616,52.0,20.0
6451,25151,elblag-milejewo,PL,+54:13:23,+019:32:36,151,PL,Poland,POL,616,52.0,20.0
6452,25156,krosno,PL,+49:42:24,+021:46:09,326,PL,Poland,POL,616,52.0,20.0
6453,25157,ylja kraftverk,NO,+61:11:49,+008:22:50,517,NO,Norway,NOR,578,62.0,10.0
6454,25159,farkollen,NO,+69:48:15,+028:59:36,321,NO,Norway,NOR,578,62.0,10.0